
public class VariableTest2 {

	public static void main(String[] args) {

		/*
		 *   변수의 종류 3가지		 
		 *   
		 *   1. 로컬 변수(local)
		 *     - 메서드안에서 변수 선언이 된다.
		 *     - 메서드 호출시 생성 ~ 메서드 작업이 종료시 제거된다.
		 *       메서드 호출할때마다 매번 생성된다.
		 *     - 스택(stack)메모리에 생성
		 *     - 주의할점은 반드시 사용전에 초기화해야 된다. ( 초기화안되면 에러발생)
		 *   2. 인스턴스 변수(instance)
		 *     - 메서드밖에서 변수 선언이 된다.
		 *     - 클래스 객체생성(new)시 생성 ~ 객체소멸시 제거된다.  
		 *       new 할때마다 매번 생성된다.
		 *     - 힙(heap) 메모리에 생성
		 *     - 사용전에 자동으로 초기화된다. ( 정수:0, 실수:0.0, 논리:false, 참조형: null )
		 *     - 접근하는 방법은 반드시 객체생성후에 접근할 수 있다. 참조변수로 접근한다.
		 *   3. 클래스 변수(static )
		 *     - 메서드밖에서 변수 선언 + static 이 된다.
		 *     - 프로그램 실행시 생성 ~ 프로그램 종료시 제거된다.
		 *       프로그램실행시 단 한번만 생성된다.
		 *     - method area 메모리에 생성
		 *     - 사용전에 자동으로 초기화된다. ( 정수:0, 실수:0.0, 논리:false, 참조형: null ) 
		 *     - 객체생성과 무관, 클래스명으로 접근한다.
		 */
	}

}






