
public class OOP {

	public static void main(String[] args) {
		
		/*
		 *     1. OOP(Object Oriented Programming)- 객체지향 프로그래밍
		 *     
		 *     2 객체(object)?
		 *      - 주체가 눈으로 바라볼때  보이는 사물 의미
		 *      예> 모니터, 노트북, 학생, 칠판, 책상,...
		 *       
		 *    3. 객체 구성 요소 2가지
		 *      
		 *      - 속성: 객체를 나타내는 특징
		 *      - 동작: 객체가 취할수 있는 행위
		 *      예> 모니터 객체
		 *         - 속성: 색상, 가격, 제조사,...
		 *         - 동작: on/off,...
		 *         
		 *         학생객체
		 *         - 속성: 학번, 이름, 전화번호, 주소,...
		 *         - 동작: 공부하기,....
		 * 
		 *    4. 객체지향 프로그래밍?
		 *                    100% 현실세계 개념(객체)을 가상세계에서 표현
		 *                       => 현실세계의 객체(속성,동작)을 잘 표현해서 가상세계의 자바로 프로그래밍할 수 있다.
		 *      현실세계       ----------------------------------->   가상세계
		 *     - 객체(사물) 
		 *     예>학생관리 프로그램개발
		 *     가. 객체추출  ---------------------------------------> 클래스
		 *       - 학생객체,교사객체,....
		 *       => 학생객체 추출 ===================================>  Student.java
		 *     나. 추출된객체의 속성과 동작 추출
		 *        - 속성: 학번, 이름, 전화번호, 주소,... ===============> 변수
		 *        - 동작: 공부하기                               ===================> 메서드
		 *        
		 *     다. 학생객체과 교사객체 관계설정
		 *     라. 학생객체의 종류 추출              ==============================> 상속관계(is a관계), has a 관계,use a 관계
		 *       ( 초등학생, 중학생,.....)
		 */
		
		
		
		
		

	}

}
